def timetohms(t):
    h = t // 3600
    m = (t % 3600) // 60
    s = (t % 3600) % 60
    return h, m, s

t1 = int(input("Введите первый отрезок времени в секундах: "))
t2 = int(input("Введите второй отрезок времени в секундах: "))
t3 = int(input("Введите третий отрезок времени в секундах: "))
t4 = int(input("Введите четвертый отрезок времени в секундах: "))
t5 = int(input("Введите пятый отрезок времени в секундах: "))

h1, m1, s1 = timetohms(t1)
h2, m2, s2 = timetohms(t2)
h3, m3, s3 = timetohms(t3)
h4, m4, s4 = timetohms(t4)
h5, m5, s5 = timetohms(t5)

print(f"Первый отрезок времени: {h1}ч., {m1} мин, {s1} секунд")
print(f"Второй отрезок времени: {h2}ч., {m2} мин, {s2} секунд")
print(f"Третий отрезок времени: {h3}ч., {m3} мин, {s3} секунд")
print(f"Четвертый отрезок времени: {h4}ч., {m4} мин, {s4} секунд")
print(f"Пятый отрезок времени: {h5}ч., {m5} мин, {s5} секунд")
